backend/app/models/scraper.rb

	def get_movies(stream)
		current_stream = Stream.find_by(name:stream.name)
---
SELECT "streams".* FROM "streams" WHERE "streams"."name" = ? LIMIT ?  [["name", "netflix"], ["LIMIT", 1]]