backend/app/controllers/movies_controller.rb

	def index
		movies = Scraper.new.get_movies(Stream.find(params[:stream_id]))
---
SELECT "streams".* FROM "streams" WHERE "streams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]