backend/app/controllers/streams_controller.rb

  def index
  	streams = Stream.all
---
SELECT "streams".* FROM "streams"