backend/app/controllers/user_streams_controller.rb

  def index
    user_streams = UserStream.find(user_params[:user_id],stream_params[:stream_id])
---
SELECT "user_streams".* FROM "user_streams" WHERE "user_streams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]