backend/app/controllers/user_streams_controller.rb

  def index
  	user_streams = UserStream.where(user_id: user_stream_params[:user_id])
---
SELECT "user_streams".* FROM "user_streams" WHERE "user_streams"."user_id" = $1  [["user_id", 1]]

  def create
  	user_stream = UserStream.find_or_create_by(user_id: user_stream_params[:user_id], stream_id: user_stream_params[:stream_id])
---
INSERT INTO "user_streams" ("user_id", "stream_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["stream_id", 1], ["created_at", "2020-05-13 00:04:19.510833"], ["updated_at", "2020-05-13 00:04:19.510833"]]

  def show
    user_stream = UserStream.where(user_id: user_stream_params[:user_id],id: user_stream_params[:id])
---
SELECT "user_streams".* FROM "user_streams" WHERE "user_streams"."user_id" = $1 AND "user_streams"."id" = $2  [["user_id", 1], ["id", 1]]

  def update
    user_stream = UserStream.find_by(user_id: user_stream_params[:user_id], stream_id: user_stream_params[:stream_id])
    user_stream.update(:selected => user_stream_params[:selected])
---
SELECT "user_streams".* FROM "user_streams" WHERE "user_streams"."user_id" = $1 AND "user_streams"."stream_id" = $2 LIMIT $3  [["user_id", 1], ["stream_id", 1], ["LIMIT", 1]]
UPDATE "user_streams" SET "selected" = $1, "updated_at" = $2 WHERE "user_streams"."id" = $3  [["selected", false], ["updated_at", "2020-05-13 00:14:14.060353"], ["id", 1]]